In [2]:
import pandas as pd

# 문제1
다음 데이터에서 과목,등급,도수(명)순으로 상위 5개 데이터만 표기하여 확인하고 
과목이 '국어 A형'과 '국어 B형'인 과목의 도수(명)의 합을 구하라

In [3]:
sat = pd.read_csv("data/2014_korea_sat_scores.csv",encoding = 'euc-kr').dropna(axis=1)

### 코드

In [4]:
data = sat[['과목','등급','도수(명)']]

In [5]:
data.head()

      과목  등급  도수(명)
0  국어 A형   1  13866
1  국어 A형   2  23599
2  국어 A형   3  42470
3  국어 A형   4  52640
4  국어 A형   5  63896

In [6]:
((data['과목'] == '국어 A형') | (sat['과목'] == '국어 B형')).head()

0    True
1    True
2    True
3    True
4    True
Name: 과목, dtype: bool

In [7]:
result = data.loc[((sat['과목'] == '국어 A형') | (sat['과목'] == '국어 B형')),
                ['도수(명)']]

In [8]:
result.sum()

도수(명)    606074
dtype: int64

# 문제2
### 위 데이터에서 과목,등급,비율(%)순으로 상위5개 데이터를 표기하여 확인한 후 한국사 과목의 1~3등급 상위권 비율을 검색하세요

In [9]:
data2 = sat[['과목','등급','비율(%)']]

In [10]:
data2

        과목  등급  비율(%)
0    국어 A형   1   4.30
1    국어 A형   2   7.32
2    국어 A형   3  13.17
3    국어 A형   4  16.32
4    국어 A형   5  19.81
..     ...  ..    ...
337    한문Ⅰ   5  20.92
338    한문Ⅰ   6  16.99
339    한문Ⅰ   7  13.79
340    한문Ⅰ   8   3.68
341    한문Ⅰ   9   3.41

[342 rows x 3 columns]

In [11]:
((data2['등급'] <= 3) & (data2['과목'] == '한국사'))

0      False
1      False
2      False
3      False
4      False
       ...
337    False
338    False
339    False
340    False
341    False
Length: 342, dtype: bool

In [12]:
result = data2.loc[((data2['등급'] <= 3) & (data2['과목'] == '한국사')),
                  ['과목','등급','비율(%)']]

In [13]:
result

     과목  등급  비율(%)
72  한국사   1   8.94
73  한국사   2   9.71
74  한국사   3   7.91

# 문제3

In [36]:
import seaborn as sns

In [37]:
diamonds = sns.load_dataset('diamonds')

In [38]:
diamonds.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [39]:
max_price_list = diamonds.nlargest(100,'price')

In [40]:
max_price_list.head()

       carat        cut color clarity  depth  table  price     x     y     z
27749   2.29    Premium     I     VS2   60.8   60.0  18823  8.50  8.47  5.16
27748   2.00  Very Good     G     SI1   63.5   56.0  18818  7.90  7.97  5.04
27747   1.51      Ideal     G      IF   61.7   55.0  18806  7.37  7.41  4.56
27746   2.07      Ideal     G     SI2   62.5   55.0  18804  8.20  8.13  5.11
27745   2.00  Very Good     H     SI1   62.8   57.0  18803  7.95  8.00  5.01

In [43]:
color_list = max_price_list['color'].value_counts(normalize = True)

In [51]:
color_list.sort_value()

AttributeError: 'Series' object has no attribute 'sort_value'

In [42]:
max_price_list['carat'].value_counts(normalize = True).head()

2.01    0.13
2.00    0.08
2.03    0.06
2.29    0.04
2.02    0.04
Name: carat, dtype: float64